package ua.hillel.school.hw8.ex1.olshop;

public class Deal {

    //в цьому прикладі розглядаємо варіант роботи онлайн магазину як торгівельної площадки
    //для угод між постачальниками та покупцями (спрощений варіант накшталт OLX або Prom)

    int number;             //номер угоди
    String type;            //тип угоди (купівля або продаж)
    int quantity;           //кількість товару за угодою
    double sum;             //загальна вартість товару
    String paymentForm;     //форма оплати (готівка або безготівкова оплата)
    String paymentType;     //тип оплати (по факту, передплата)
    String receiving;       //дата постачання

}
